js_project_backend/app/controllers/api/v1/books_controller.rb

    def create
        book = Book.create(book_params)
---
INSERT INTO "books" ("title", "author", "review", "rating", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "test2"], ["author", "test2"], ["review", "test2"], ["rating", 1], ["user_id", 3], ["created_at", "2020-07-18 21:30:57.138445"], ["updated_at", "2020-07-18 21:30:57.138445"]]

    def destroy
        book = Book.find_by(:id => params[:id]).destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]