js_project_backend/app/controllers/api/v1/users_controller.rb

    def create
        if User.find_by(:name => user_params[:name])
            user = User.find_by(:name => user_params[:name])
            redirect_to "/api/v1/users/#{user.id}"
        else
            user = User.create(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "collin"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "kierra"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "collin"], ["created_at", "2020-07-18 20:56:28.614569"], ["updated_at", "2020-07-18 20:56:28.614569"]]

    def show
        @user = User.find_by(:id => params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]